Repository: quarkusio/es.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en
Languages: es_es

source: Most of our updates go out on <a href="https://twitter.com/quarkusio">Twitter</a>. Sometimes our project team speaks at industry events, and sometimes they post cool ways people use Quarkus. Wash, rinse, and retweet.
es_es: La mayoría de nuestras actualizaciones se publican en <a href="https://twitter.com/quarkusio">Twitter</a>. A veces, nuestro equipo de proyectos habla en eventos de la industria, y a veces publican formas geniales en que la gente usa Quarkus. Lavar, enjuagar y retuitear.

source: Most useful operations
es_es: Operaciones más útiles

source: Multiple ways to connect with others via forum, stack, chat, or email groups.
es_es: Múltiples formas de conectarse con otros a través de foros, stack, chat o grupos de correo electrónico.

source: NON-STANDARD FEATURES
es_es: CARACTERÍSTICAS NO ESTÁNDAR

source: NOTE
es_es: NOTA

source: Name
es_es: Nombre

source: Narayana LRA Participant Support
es_es: Apoyo a los participantes en el LRA de Narayana

source: Native
es_es: Nativo

source: Native Image Pre-Boot
es_es: Imagen nativa previa al arranque

source: Native executable
es_es: Ejecución nativa

source: Need More Than Community Support?
es_es: ¿Necesita algo más que apoyo comunitario?

source: Newsletter
es_es: Boletín de noticias

source: Next Steps
es_es: Próximos pasos

source: Next steps
es_es: Próximos pasos

source: Next, a docker image is required by Knative, so you'll need to build that next:
es_es: A continuación, Knative necesita una imagen docker, así que tendrás que construirla:

source: Next, we want to expose our application using the Kubernetes Ingress resource:
es_es: A continuación, queremos exponer nuestra aplicación utilizando el recurso Kubernetes Ingress:

source: No hassle native executable generation
es_es: Generación de ejecutables nativos sin complicaciones

source: Non-standard Features
es_es: Características no estándar

source: Normally, optional Maven extension dependencies are ignored by the Quarkus dependency resolver at build time. In this case though, the optional dependency `quarkus-extension-b` includes a dependency condition in its extension descriptor, which turns this optional Maven dependency into a Quarkus conditional extension dependency.
es_es: Normalmente, las dependencias opcionales de las extensiones de Maven son ignoradas por el resolvedor de dependencias de Quarkus en tiempo de construcción. Sin embargo, en este caso, la dependencia opcional `quarkus-extension-b` incluye una condición de dependencia en su descriptor de extensión, que convierte esta dependencia opcional de Maven en una dependencia de extensión condicional de Quarkus.

source: Note that UPX compression:
es_es: Tenga en cuenta que la compresión UPX:

source: Note that the Elasticsearch hosts property is automatically configured with the chosen port.
es_es: Tenga en cuenta que la propiedad de hosts de Elasticsearch se configura automáticamente con el puerto elegido.

source: Note that the Kafka advertised address is automatically configured with the chosen port.
es_es: Tenga en cuenta que la dirección anunciada de Kafka se configura automáticamente con el puerto elegido.

source: Note that the Kafka channels in SmallRye Reactive messaging are automatically configured with the chosen port.
es_es: Tenga en cuenta que los canales Kafka en la mensajería reactiva de SmallRye se configuran automáticamente con el puerto elegido.

source: Note that the default startup timeout is 60s, if this is not enough you can increase it with the `quarkus.devservices.timeout` property.
es_es: Tenga en cuenta que el tiempo de espera de inicio por defecto es de 60s, si esto no es suficiente puede aumentarlo con la propiedad `quarkus.devservices.timeout`.

source: November 19, 2019
es_es: 19 de noviembre de 2019

source: Now Available
es_es: Ya está disponible

source: Now create the Docker instance on ACI pointing to your image on ACR:
es_es: Ahora cree la instancia Docker en ACI apuntando a su imagen en ACR:

source: Now we are ready to run our application:
es_es: Ahora estamos listos para ejecutar nuestra aplicación:

source: Now you can rebuild the docker image:
es_es: Ahora puedes reconstruir la imagen docker:

source: Now you can start your application and Quarkus will run the Liquibase's update method according to your config.
es_es: Ahora puedes iniciar tu aplicación y Quarkus ejecutará el método de actualización de Liquibase según tu configuración.

source: Now, having a dependency activating condition in the descriptor of `quarkus-extension-b`, other extensions may declare a conditional dependency on it.
es_es: Ahora, al tener una condición de activación de la dependencia en el descriptor de `quarkus-extension-b`, otras extensiones pueden declarar una dependencia condicional sobre ella.

source: Of course, you can use the Heroku CLI to connect this repo to your GitHub account, too, but this is out of scope for this guide.
es_es: Por supuesto, también puedes utilizar la CLI de Heroku para conectar este repositorio a tu cuenta de GitHub, pero esto está fuera del alcance de esta guía.

source: Oh yeah! We had quite a few extensions written outside the Quarkus "initial" team.
es_es: ¡Por supuesto! Se ha creado un número significativo de extensiones fuera del equipo "inicial" de Quarkus.

source: On a post request, generate a random UUID and send it to the AMQP queue using the emitter.
es_es: En una solicitud de publicación, genera un UUID aleatorio y lo envía a la cola AMQP utilizando el emisor.

source: Once added to your project, you can map _channels_ to AMQP addresses by configuring the `connector` attribute:
es_es: Una vez añadido a tu proyecto, puedes asignar _canales_ a direcciones AMQP configurando el atributo `connector`:

source: Once deployed, the application will be running on whatever port is used to expose the service. By default, Quarkus apps run on port 8080 internally.
es_es: Una vez desplegada, la aplicación se ejecutará en cualquier puerto que se utilice para exponer el servicio. Por defecto, las aplicaciones de Quarkus se ejecutan internamente en el puerto 8080.

source: Once generated, you can look at the `target/kubernetes` directory:
es_es: Una vez generado, puede consultar el directorio `target/kubernetes`:

source: Once installed, ensure you are authenticated:
es_es: Una vez instalado, asegúrese de estar autentificado:

source: Once started, you can request the provided endpoint:
es_es: Una vez iniciado, puede usar el endpoint proporcionado:

source: Once you have written your repository, here are the most common operations you will be able to perform:
es_es: Una vez que haya escrito su repositorio, estas son las operaciones más comunes que podrá realizar:

source: One Google Cloud Functions deployment can represent any number of JAX-RS, Servlet, Reactive Routes, or xref:funqy-http.adoc[Funqy HTTP] endpoints.
es_es: Una implementación de Google Cloud Functions puede representar cualquier número de endpoints JAX-RS, Servlet, Rutas Reactivas o xref:funqy-http.html[Funqy HTTP].

source: One azure function deployment can represent any number of JAX-RS, servlet, Reactive Routes, or xref:funqy-http.adoc[Funqy HTTP] endpoints.
es_es: Un despliegue de funciones azure puede representar cualquier número de endpoints JAX-RS, servlet, Reactive Routes o xref:funqy-http.html[Funqy HTTP].

source: One of the main goals of Quarkus is ease of extensibility and to build a vibrant ecosystem.
es_es: Uno de los principales objetivos de Quarkus es la facilidad de extensibilidad y la construcción de un ecosistema vibrante.

source: One possible way to make Quarkus use these entries to connect the database is to use the following configuration:
es_es: Una posible forma de hacer que Quarkus utilice estas entradas para conectar la base de datos es utilizar la siguiente configuración:

source: Only a single provider of any given capability is allowed in an application. If more than one provider of a capability is detected, the application build will fail with the corresponding error message.
es_es: Sólo se permite un único proveedor de cualquier capacidad en una aplicación. Si se detecta más de un proveedor de una capacidad, la compilación de la aplicación fallará con el mensaje de error correspondiente.

source: Only text based media types are supported at the moment as Azure Functions HTTP Trigger for Java does not support a binary format
es_es: Por el momento, sólo se admiten los tipos de medios basados en texto, ya que Azure Functions HTTP Trigger para Java no admite un formato binario

source: Open Source Utterly and Absolutely
es_es: Código abierto de forma total y absoluta

source: Open `http://localhost:8080/quotes.html` in your browser and request some quotes by clicking the button.
es_es: Abra `http://localhost:8080/quotes.html` en su navegador y solicite algunos presupuestos haciendo clic en el botón.

source: Open a separate terminal. You'll first need to learn the URL of the broker. Execute this command to find it.
es_es: Abra un terminal independiente. Primero tendrás que conocer la URL del broker. Ejecuta este comando para encontrarlo.

source: Open the two projects in your favorite IDE.
es_es: Abra los dos proyectos en su IDE favorito.

source: Open your browser to http://localhost:8080/greeting.
es_es: Abra su navegador en http://localhost:8080/greeting.

source: Open your favorite terminal and use JBang to install the Quarkus CLI. You do not need to have Java installed first.
es_es: Abre tu terminal favorito y usa JBang para instalar el Quarkus CLI. No es necesario tener Java instalado primero.

source: OpenID Connect (OIDC) configuration properties
es_es: Propiedades de configuración de OpenID Connect (OIDC)

source: Optionally get <a href="https://www.graalvm.org/" target="_blank">GraalVM</a> {{ site.data.versions.graalvm }} for native compilation
es_es: Opcionalmente obtener <a href="https://www.graalvm.org/" target="_blank">GraalVM</a> {{ site.data.versions.graalvm }} para la compilación nativa

source: Or just add the following dependency to your project:
es_es: O simplemente añada la siguiente dependencia a su proyecto:

source: Or take a look into the World of Warcraft Auctions - Batch Application. It downloads the World of Warcraft Auction House data and provides statistics about items prices.
es_es: O echa un vistazo a la aplicación Batch Subastas de World of Warcraft. Descarga los datos de la Casa de Subastas de World of Warcraft y proporciona estadísticas sobre los precios de los artículos.

source: Or, you can also install the CLI with SDKMAN!
es_es: ¡O también puedes instalar la CLI con SDKMAN!

source: Or, you can retrieve the Message<Double>:
es_es: O bien, puede recuperar el Message<Double>:

source: Other base images might provide launch scripts that enable debugging when an environment variable is set, in which case you would set than environment variable when launching the container.
es_es: Otras imágenes base pueden proporcionar scripts de lanzamiento que permiten la depuración cuando se establece una variable de entorno, en cuyo caso se establecería esa variable de entorno al lanzar el contenedor.

source: Others
es_es: Otros

source: Our dependency injection solution is based on CDI. You can use JAX-RS annotations to define the REST endpoints. You can use JPA annotations to map your persistent entities and JTA annotations to declare the transaction boundaries. You can use Eclipse MicroProfile to configure and monitor your application. You can use Vert.x, Apache Camel and we support much more.
es_es: Nuestra solución de inyección de dependencia se basa en CDI. Puede utilizar anotaciones JAX-RS para definir los puntos finales REST. Puede utilizar anotaciones JPA para mapear sus entidades persistentes y anotaciones JTA para declarar los límites de las transacciones. Puede utilizar Eclipse MicroProfile para configurar y supervisar su aplicación. Puede utilizar Vert.x, Apache Camel y soportamos mucho más.

source: Our monthly newsletters bring together articles, videos and perspectives from across the Quarkus community.
es_es: Nuestros boletines mensuales reúnen artículos, vídeos y perspectivas de toda la comunidad de Quarkus.

source: Outbound Metadata
es_es: Metadatos de salida

source: Outgoing channel configuration
es_es: Configuración del canal de salida

source: Overall, the move to Quarkus has been a very positive experience, with real benefits in terms of developer productivity and operational efficiency. The team has been using Quarkus in production for the Adoptium API since November 2019 and has proved to be extremely stable.
es_es: En general, el cambio a Quarkus ha sido una experiencia muy positiva, con beneficios reales en términos de productividad de los desarrolladores y eficiencia operativa. El equipo ha estado utilizando Quarkus en producción para la API de Adoptium desde noviembre de 2019 y ha demostrado ser extremadamente estable.

source: Overall, we have been very impressed with the capabilities of Quarkus, and our experience with the Quarkus community has been fantastic. We look forward to seeing how it evolves, and improving how we serve the Java community’s Java distribution needs for years to come!
es_es: En general, hemos quedado muy impresionados con las capacidades de Quarkus, y nuestra experiencia con la comunidad de Quarkus ha sido fantástica. Estamos deseando ver cómo evoluciona y mejorar la forma en que servimos a las necesidades de distribución de Java de la comunidad en los próximos años!

source: Package and run the application
es_es: Empaquetar y ejecutar la aplicación

source: Packaging and run the application
es_es: Empaquetar y ejecutar la aplicación

source: Packaging of the application
es_es: Packaging de la aplicación

source: Performance implications
es_es: Implicaciones del rendimiento

source: Platform
es_es: Plataforma

source: Please also see xref:security-testing.adoc#configuring-user-information[Configuring User Information in application.properties] section.
es_es: Consulte también la sección xref:security-testing.html#configuring-user-information[Configuración de la información del usuario en application.properties].

source: Please report any security issues you find in Quarkus to:
es_es: Por favor informe cualquier problema de seguridad que encuentre en Quarkus a:

source: Please see xref:security.adoc#identity-providers[Security Identity Providers] for more information.
es_es: Para más información, consulte xref:security.html#identity-providers[Proveedores de Identidad de Seguridad].

source: Predefined Topology
es_es: Topología predefinida

source: Prepare the Quarkus HTTP Port
es_es: Preparar el puerto HTTP de Quarkus

source: Prerequisites
es_es: Requisitos previos

source: Prints the failures to the console again, this can be useful if there has been lots of console output since the last run.
es_es: Imprime los fallos en la consola de nuevo, esto puede ser útil si ha habido mucha salida en la consola desde la última ejecución.

source: Priority of obtained properties
es_es: Prioridad de las propiedades obtenidas

source: Procedure
es_es: Procedimiento

source: Processing quote requests
es_es: Tramitación de solicitudes de quota

source: Profiles
es_es: Perfiles

source: Project Homepage
es_es: Página web del proyecto

source: Properties Files Realm Configuration
es_es: Archivos de propiedades Configuración del dominio

source: Proven Java for the Cloud
es_es: Java probado para la nube

source: Provided by JBeret project
es_es: Proporcionado por el proyecto JBeret

source: Provided by the JBeret Project Team
es_es: Proporcionado por el equipo del proyecto JBeret

source: Publications
es_es: Publicaciones

source: Publishing new records
es_es: Publicación de nuevos registros

source: Pull Requests
es_es: Solicitudes de extracción

source: Push your image to docker hub or quay
es_es: Envíe su imagen a docker hub o quay

source: Pushing
es_es: Subiendo

source: Q Tips
es_es: Q Consejos

source: QUARKUS GUIDES
es_es: GUÍAS DE QUARKUS

source: Quarkus 2.0 continues the mission of making Java the preferred framework for Kubernetes-native development with new developer tools and improved performance.
es_es: Quarkus 2.0 continúa la misión de hacer de Java el marco preferido para el desarrollo nativo de Kubernetes con nuevas herramientas para desarrolladores y un rendimiento mejorado.

source: Quarkus 3.3.1 released - Maintenance release
es_es: Lanzamiento Quarkus 3.3.1 - Versión de mantenimiento

source: Quarkus Base Runtime Image
es_es: Imagen de tiempo de ejecución de Quarkus Base

source: Quarkus Build Time Principle
es_es: Principio de tiempo de construcción de Quarkus

source: Quarkus Chat Options
es_es: Opciones de chat de Quarkus

source: Quarkus Code Snippets
es_es: Fragmentos de código de Quarkus

source: Quarkus Conditional Extension Dependencies
es_es: Dependencias de la extensión condicional de Quarkus

source: Quarkus Development
es_es: Desarrollo de Quarkus

source: Quarkus Features
es_es: Características de Quarkus

source: Quarkus Insights Podcast
es_es: Podcast de Quarkus Insights

source: Quarkus JBeret Extension
es_es: Extensión JBeret de Quarkus

source: Quarkus Maven Plugin
es_es: Plugin Quarkus Maven

source: Quarkus Tools in Your Favorite IDE
es_es: Herramientas de Quarkus en su IDE favorito

source: Quarkus Tools in your favorite IDE
es_es: Herramientas Quarkus en su IDE favorito

source: Quarkus Version
es_es: Versión de Quarkus

source: Quarkus World Tour
es_es: Gira mundial de Quarkus

source: Quarkus aids you on your journey to reactive. Quarkus is based on a <a href="https://quarkus.io/version/main/guides/quarkus-reactive-architecture">reactive core</a> allowing your application to mix reactive and imperative components. As an example, you can implement reactive HTTP endpoint using the <a href="https://quarkus.io/guides/resteasy-reactive">RESTEasy Reactive extension</a> as follows:
es_es: Quarkus te ayuda en tu viaje hacia lo reactivo. Quarkus se basa en un <a href="https://quarkus.io/version/main/guides/quarkus-reactive-architecture">núcleo reactivo</a>que permite a tu aplicación mezclar componentes reactivos e imperativos. Como ejemplo, puedes implementar un endpoint HTTP reactivo usando la extensión <a href="https://quarkus.io/guides/resteasy-reactive">RESTEasy Reactive</a> como sigue:

source: Quarkus application configuration may include two types of configuration options:
es_es: La configuración de la aplicación Quarkus puede incluir dos tipos de opciones de configuración:

source: Quarkus applications are designed to run in containers.
es_es: Las aplicaciones de Quarkus están diseñadas para ejecutarse en contenedores.

source: Quarkus applications are optimised for low memory usage and fast startup times.
es_es: Las aplicaciones de Quarkus están optimizadas para un uso de memoria bajo y tiempos de inicio rápidos.

source: Quarkus comes with a toolchain enabling developers from live reload all the way down to deploying a Kubernetes application. In addition, there are plugins and extensions to all major IDEs.
es_es: Quarkus viene con una cadena de herramientas que permite a los desarrolladores desde la recarga en vivo hasta el despliegue de una aplicación Kubernetes. Además, hay plugins y extensiones para los principales IDEs.

source: Quarkus extension dependencies are usually configured in the same way as any other project dependencies in the project's build file, e.g. the Maven `pom.xml` or the Gradle build scripts. However, there are dependency types that aren't yet supported out-of-the-box by Maven and Gradle. What we refer here to as "conditional dependencies" is one example.
es_es: Las dependencias de las extensiones de Quarkus normalmente se configuran de la misma manera que cualquier otra dependencia del proyecto en el archivo de construcción del proyecto, por ejemplo, en Maven `pom.xml` o en los scripts de construcción de Gradle. Sin embargo, hay tipos de dependencias que todavía no están soportadas por Maven y Gradle. Lo que aquí llamamos "dependencias condicionales" es un ejemplo.

source: Quarkus extensions may provide certain capabilities and require certain capabilities to be provided by other extensions in an application to function properly.
es_es: Las extensiones de Quarkus pueden proporcionar ciertas capacidades y requerir que otras extensiones proporcionen ciertas capacidades en una aplicación para funcionar correctamente.

source: Quarkus focuses on the simplest and most useful way to use a given feature, trimming it to its most useful essence. This includes upfront analysis on how to best use a feature and guiding you in what we think is the best way to do things.
es_es: Quarkus se centra en la forma más sencilla y útil de utilizar una determinada función, reduciéndola a su esencia más útil. Esto incluye un análisis previo sobre la mejor manera de utilizar una característica y guiarle en lo que creemos que es la mejor manera de hacer las cosas.

source: Quarkus forces a packaging of type `uber-jar` for your function as Google Cloud Function deployment requires a single JAR.
es_es: Quarkus obliga a un empaquetado de tipo `uber-jar` para su función, ya que el despliegue de Google Cloud Function requiere un único JAR.

source: Quarkus gRPC is based on https://vertx.io/docs/vertx-grpc/java/[Vert.x gRPC].
es_es: Quarkus gRPC se basa en https://vertx.io/docs/vertx-grpc/java/[Vert.x gRPC].

source: Quarkus has been designed with this new world in mind and provides first-class support for these different paradigms. That does not mean you cannot build monoliths with Quarkus; you can do it smoothly. On the contrary, it means that the Quarkus development model morphs to adapt itself to the type of application you are developing, monolith, microservice, reactive, event-driven, functions…
es_es: Quarkus ha sido diseñado con este nuevo mundo en mente y proporciona soporte de primera clase para estos diferentes paradigmas. Esto no significa que no puedas construir monolitos con Quarkus; puedes hacerlo sin problemas. Al contrario, significa que el modelo de desarrollo de Quarkus se transforma para adaptarse al tipo de aplicación que estés desarrollando, monolito, microservicio, reactivo, dirigido por eventos, funciones...

source: Quarkus has built-in capabilities to deal with JSON AMQP messages.
es_es: Quarkus tiene capacidades incorporadas para tratar con mensajes JSON AMQP.

source: Quarkus has more Spring compatibility features. See the following guides for more details:
es_es: Quarkus tiene más características de compatibilidad con Spring. Consulte las siguientes guías para obtener más detalles:

source: Quarkus includes an extension that allows developers to use Kubernetes ConfigMaps and Secrets as a configuration source, without having to mount them into the Pod running the Quarkus application or make any other modifications to their Kubernetes Deployment (or Openshift DeploymentConfig) <a href="{{site.baseurl}}/guides/kubernetes-config">Read the guide for more details.</a>
es_es: Quarkus incluye una extensión que permite a los desarrolladores utilizar Kubernetes ConfigMaps y Secrets como fuente de configuración, sin tener que montarlos en el Pod que ejecuta la aplicación Quarkus ni realizar ninguna otra modificación en su Kubernetes Deployment (o Openshift DeploymentConfig) <a href="{{site.baseurl}}/guides/kubernetes-config">Lee la guía para más detalles.</a>
